import { LessonProps } from "../../models/interfaces";
import video from "../../images/Lessons/Rectangle 92.svg";

export const lessonsArr: LessonProps[] = [
  {
    title: "Գրաֆիկ դիզայնի դասընթաց սկսնակների համար",
    keys: [
      "Արվեստ և դիզայն",
      "Սկսնակների համար",
      "Հավաստագիր",
      "16+",
      "Ավարտական քննություն",
      "165 ժամ",
    ],
    description:
      "Դասընթացի նկարագրությունը, Որպեսզի արդյունքի հասնելու համար, որն ավելի շատ համապատասխանի վերջնական արդյունքին, գրաֆիկական դիզայներները, դիզայներները կամ տպիչները գրի են առնում ",
    price: "65 000 դրամ",
    video: video,
  },
  {
    title: "Գրաֆիկ դիզայնի դասընթաց սկսնակների համար",
    keys: [
      "Արվեստ և դիզայն",
      "Սկսնակների համար",
      "Հավաստագիր",
      "16+",
      "Ավարտական քննություն",
      "185 ժամ",
    ],
    description:
      "Դասընթացի նկարագրությունը, Որպեսզի արդյունքի հասնելու համար, որն ավելի շատ համապատասխանի վերջնական արդյունքին, գրաֆիկական դիզայներները, դիզայներները կամ տպիչները գրի են առնում ",
    price: "70 000 դրամ",
    video: video,
  },
  {
    title: "Գրաֆիկ դիզայնի դասընթաց սկսնակների համար",
    keys: [
      "Արվեստ և դիզայն",
      "Սկսնակների համար",
      "Հավաստագիր",
      "16+",
      "Ավարտական քննություն",
      "200 ժամ",
    ],
    description:
      "Դասընթացի նկարագրությունը, Որպեսզի արդյունքի հասնելու համար, որն ավելի շատ համապատասխանի վերջնական արդյունքին, գրաֆիկական դիզայներները, դիզայներները կամ տպիչները գրի են առնում ",
    price: "100 000 դրամ",
    video: video,
  },
  {
    title: "Գրաֆիկ դիզայնի դասընթաց սկսնակների համար",
    keys: [
      "Արվեստ և դիզայն",
      "Սկսնակների համար",
      "Հավաստագիր",
      "16+",
      "Ավարտական քննություն",
      "165 ժամ",
    ],
    description:
      "Դասընթացի նկարագրությունը, Որպեսզի արդյունքի հասնելու համար, որն ավելի շատ համապատասխանի վերջնական արդյունքին, գրաֆիկական դիզայներները, դիզայներները կամ տպիչները գրի են առնում ",
    price: "65 000 դրամ",
    video: video,
  },
];
