import { LessonProps } from "../../models/interfaces";

export const lessonsArr: LessonProps[] = [
  {
    title: "Գրաֆիկ դիզայնի դասընթաց սկսնակների համար",
    keys: [
      "Արվեստ և դիզայն",
      "Սկսնակների համար",
      "Հավաստագիր",
      "16+",
      "Ավարտական քննություն",
      "165 ժամ",
    ],
    description:
      "Դասընթացի նկարագրությունը, Որպեսզի արդյունքի հասնելու համար, որն ավելի շատ համապատասխանի վերջնական արդյունքին, գրաֆիկական դիզայներները, դիզայներները կամ տպիչները գրի են առնում ",
    price: "65 000 դրամ",
    video: "https://www.youtube.com/embed/2m8CuP45C2o",
  },
  {
    title: "Գրաֆիկ դիզայնի դասընթաց սկսնակների համար",
    keys: [
      "Արվեստ և դիզայն",
      "Սկսնակների համար",
      "Հավաստագիր",
      "16+",
      "Ավարտական քննություն",
      "185 ժամ",
    ],
    description:
      "Դասընթացի նկարագրությունը, Որպեսզի արդյունքի հասնելու համար, որն ավելի շատ համապատասխանի վերջնական արդյունքին, գրաֆիկական դիզայներները, դիզայներները կամ տպիչները գրի են առնում ",
    price: "70 000 դրամ",
    video: "https://www.youtube.com/embed/LcmoLQEJeU4",
  },
  {
    title: "Գրաֆիկ դիզայնի դասընթաց սկսնակների համար",
    keys: [
      "Արվեստ և դիզայն",
      "Սկսնակների համար",
      "Հավաստագիր",
      "16+",
      "Ավարտական քննություն",
      "200 ժամ",
    ],
    description:
      "Դասընթացի նկարագրությունը, Որպեսզի արդյունքի հասնելու համար, որն ավելի շատ համապատասխանի վերջնական արդյունքին, գրաֆիկական դիզայներները, դիզայներները կամ տպիչները գրի են առնում ",
    price: "100 000 դրամ",
    video: "https://www.youtube.com/embed/AqyGUltWd0U",
  },
  {
    title: "Գրաֆիկ դիզայնի դասընթաց սկսնակների համար",
    keys: [
      "Արվեստ և դիզայն",
      "Սկսնակների համար",
      "Հավաստագիր",
      "16+",
      "Ավարտական քննություն",
      "165 ժամ",
    ],
    description:
      "Դասընթացի նկարագրությունը, Որպեսզի արդյունքի հասնելու համար, որն ավելի շատ համապատասխանի վերջնական արդյունքին, գրաֆիկական դիզայներները, դիզայներները կամ տպիչները գրի են առնում ",
    price: "65 000 դրամ",
    video: "https://www.youtube.com/embed/AqyGUltWd0U",
  },
];
